from math import factorial as f

n = f(100)
s = 0


while n > 0:
    digit = n % 10
    s = s + digit
    n = n // 10
print(s)
'''n! означает n × (n − 1) × ... × 3 × 2 × 1

Например, 10! = 10 × 9 × ... × 3 × 2 × 1 = 3628800,
и сумма цифр в числе 10! равна 3 + 6 + 2 + 8 + 8 + 0 + 0 = 27.

Найдите сумму цифр в числе 100!.